; domain
(define (domain default)
  (:requirements :strips :typing :conditional-effects)  ; Specifies the requirements: STRIPS, ADL, and typing.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
    capacity - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Indicates that ?l1 is adjacent to ?l2.
    (at ?o - locatable ?l - location)  ; Indicates that object ?o is at location ?l.
    (empty ?b - box)   ; Indicates that ?b, a box, is empty.
    (free_arms ?a - agent) ; Indicates that agent ?a has free arms (not carrying a box).
    (box_carried_by ?b - box ?a - agent) ; Indicates that ?b, a box, is being carried by ?a, an agent.
    (contains ?b - box ?s - supply) ; Indicates that ?b, a box, contains ?s, a supply.
    (is ?s - supply ?t - supply_type) ; Indicates the supply_type ?t of a supply ?s.
    (has ?ws - workstation ?t - supply_type) ; Indicates that workstation ?ws requires a supply of supply_type ?t.
    (loaded_to ?s - supply ?ws - workstation) ; Indicates that supply ?s has been loaded to workstation ?ws.
    (unloaded_box ?b - box ?ws - workstation)
    (attached ?c - carrier ?a - agent) ; A carrier is attached to an agent.
    (on ?c - carrier ?b - box) ; A box is on a carrier.
      ;; capacity
    (carrier_capacity ?c - carrier ?cap - capacity)
    (predecessor ?cap0 - capacity ?cap1 - capacity)
  )
  
  ;; Actions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; Requires ?from to be adjacent to ?to.
      (at ?a ?from)  ; Agent ?a must be at the ?from location.
    )
    :effect (and 
      (at ?a ?to)  ; Agent ?a is now at ?to location.
      (not (at ?a ?from))  ; Agent ?a is no longer at ?from location.
    )
  )
  
  (:action take_box
    :parameters (?a - agent ?b - box ?c - carrier ?l - location ?c0 ?c1 - capacity)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?b ?l)  ; Box ?b must be at ?l location.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c1)
    )
    :effect (and 
      (not (at ?b ?l))  ; Box ?b is no longer at ?l location.
      (box_carried_by ?b ?a)  ; Box ?b is now carried by agent ?a.
      (carrier_capacity ?c ?c0)
      (not (carrier_capacity ?c ?c1))  
      (on ?c ?b)
    )
  )
  
  (:action fill_box
    :parameters (?a - agent ?b - box ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?s ?l)  ; Supply ?s must be at ?l location.
      (empty ?b)  ; Box ?b must be empty.
      (box_carried_by ?b ?a)
    )
    :effect (and 
      (not (empty ?b))  ; Box ?b is no longer empty.
      (contains ?b ?s)  ; Box ?b now contains supply ?s.
      (not (at ?s ?l))  ; Supply ?s is no longer at ?l location.
    )
  )

  (:action deliver_box
    :parameters (?a - agent ?b - box ?c - carrier ?ws - workstation ?l - location ?c0 ?c1 - capacity)
    :precondition (and 
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (on ?c ?b)  ; The box must be on the carrier.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c0)
    )
    :effect (and 
      (not (box_carried_by ?b ?a))  ; Box ?b is no longer carried by agent ?a.
      (not (on ?c ?b))
      (unloaded_box ?b ?ws)
      (carrier_capacity ?c ?c1)
      (not (carrier_capacity ?c ?c0))    
    )
  )
    
  (:action deliver_supply
    :parameters (?a - agent ?ws - workstation ?t - supply_type ?s - supply ?b - box ?l - location )
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)  ; Workstation ?ws must be at ?l location.
      (is ?s ?t)  ; Supply ?s must be of supply_type ?t.
      (unloaded_box ?b ?ws)
      (contains ?b ?s)  ; Box ?b must contain supply ?s.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; Supply ?s is now loaded to workstation ?ws.
      (not (contains ?b ?s))  ; Box ?b no longer contains supply ?s.
      (not (unloaded_box ?b ?ws))
      (empty ?b)  ; Box ?b is now empty.
      (at ?b ?l)
      (has ?ws ?t)  ; Workstation ?ws now has a supply of supply_type ?t.
    )
  )
)

; problem
;; problem file: problem_3.pddl
(define (problem default)
  (:domain default)
  (:objects l6_1 l5_6 l4_5 l4_2 l6_6 l5_3 l5_2 l5_1 l4_1 l6_0 l4_3 l6_5 l6_4 l4_0 l5_0 l4_4 l5_4 l6_2 l5_5 l6_3 - location agent_1 agent_0 - agent supply_0 supply_2 supply_1 - supply box_2 box_1 box_0 box_3 - box workstation_0 - workstation warehouse_0 - warehouse carrier_0 carrier_1 - carrier bolt valve tool - supply_type capacity_2 capacity_0 capacity_1 - capacity )
  (:init (empty box_3) (adjacent l5_2 l5_1) (adjacent l6_2 l5_2) (adjacent l5_5 l5_6) (adjacent l4_4 l5_4) (empty box_2) (at agent_1 l5_2) (adjacent l6_5 l5_5) (adjacent l6_5 l6_4) (predecessor capacity_1 capacity_2) (adjacent l6_0 l5_0) (adjacent l4_5 l5_5) (adjacent l5_4 l4_4) (adjacent l5_2 l4_2) (adjacent l5_1 l4_1) (empty box_1) (adjacent l5_5 l4_5) (adjacent l4_1 l4_0) (adjacent l5_3 l5_4) (attached carrier_0 agent_0) (empty box_0) (at supply_2 l5_2) (adjacent l6_3 l6_2) (adjacent l4_3 l4_4) (adjacent l4_3 l5_3) (adjacent l6_4 l5_4) (at agent_0 l5_2) (adjacent l4_4 l4_3) (at box_0 l5_2) (adjacent l4_5 l4_4) (adjacent l5_3 l6_3) (adjacent l6_2 l6_1) (adjacent l5_1 l5_2) (adjacent l5_5 l6_5) (at supply_1 l5_2) (adjacent l6_3 l6_4) (adjacent l4_2 l5_2) (adjacent l6_3 l5_3) (attached carrier_1 agent_1) (adjacent l5_5 l5_4) (adjacent l6_1 l6_0) (adjacent l5_6 l6_6) (adjacent l5_1 l5_0) (adjacent l4_0 l5_0) (adjacent l5_2 l6_2) (at box_2 l5_2) (adjacent l5_6 l5_5) (adjacent l6_6 l6_5) (carrier_capacity carrier_0 capacity_2) (is supply_0 valve) (adjacent l4_1 l5_1) (adjacent l6_2 l6_3) (adjacent l4_2 l4_1) (adjacent l5_1 l6_1) (carrier_capacity carrier_1 capacity_2) (adjacent l6_4 l6_3) (loaded_to supply_1 workstation_0) (adjacent l6_1 l5_1) (adjacent l5_3 l4_3) (at workstation_0 l4_5) (is supply_1 bolt) (adjacent l6_1 l6_2) (adjacent l5_4 l6_4) (at supply_0 l5_2) (at box_1 l5_2) (adjacent l4_2 l4_3) (is supply_2 tool) (adjacent l4_3 l4_2) (adjacent l5_2 l5_3) (adjacent l5_4 l5_5) (adjacent l5_4 l5_3) (adjacent l4_4 l4_5) (loaded_to supply_0 workstation_0) (adjacent l6_4 l6_5) (at box_3 l5_2) (adjacent l6_0 l6_1) (adjacent l4_0 l4_1) (adjacent l5_0 l6_0) (at warehouse_0 l5_2) (predecessor capacity_0 capacity_1) (adjacent l6_6 l5_6) (adjacent l5_0 l4_0) (adjacent l5_0 l5_1) (adjacent l6_5 l6_6) (adjacent l5_3 l5_2) (adjacent l4_1 l4_2))
  (:goal (and (has workstation_0 tool)))
)

; plan
1. (take_box agent_1 box_0 carrier_1 l5_2 capacity_1 capacity_2)
   deleted: (at box_0 l5_2) (carrier_capacity carrier_1 capacity_2)
   added: (box_carried_by box_0 agent_1) (carrier_capacity carrier_1 capacity_1) (on carrier_1 box_0)
   goals met: 0 of 1
2. (move agent_1 l5_2 l4_2)
   deleted: (at agent_1 l5_2)
   added: (at agent_1 l4_2)
   goals met: 0 of 1
3. (move agent_1 l4_2 l4_3)
   deleted: (at agent_1 l4_2)
   added: (at agent_1 l4_3)
   goals met: 0 of 1
4. (move agent_1 l4_3 l4_4)
   deleted: (at agent_1 l4_3)
   added: (at agent_1 l4_4)
   goals met: 0 of 1
5. (move agent_1 l4_4 l4_5)
   deleted: (at agent_1 l4_4)
   added: (at agent_1 l4_5)
   goals met: 0 of 1
6. (take_box agent_0 box_1 carrier_0 l5_2 capacity_1 capacity_2)
   deleted: (at box_1 l5_2) (carrier_capacity carrier_0 capacity_2)
   added: (box_carried_by box_1 agent_0) (carrier_capacity carrier_0 capacity_1) (on carrier_0 box_1)
   goals met: 0 of 1
7. (fill_box agent_0 box_1 supply_2 l5_2)
   deleted: (empty box_1) (at supply_2 l5_2)
   added: (contains box_1 supply_2)
   goals met: 0 of 1
8. (move agent_0 l5_2 l4_2)
   deleted: (at agent_0 l5_2)
   added: (at agent_0 l4_2)
   goals met: 0 of 1
9. (move agent_0 l4_2 l4_3)
   deleted: (at agent_0 l4_2)
   added: (at agent_0 l4_3)
   goals met: 0 of 1
10. (move agent_0 l4_3 l4_4)
   deleted: (at agent_0 l4_3)
   added: (at agent_0 l4_4)
   goals met: 0 of 1
11. (move agent_0 l4_4 l4_5)
   deleted: (at agent_0 l4_4)
   added: (at agent_0 l4_5)
   goals met: 0 of 1
12. (deliver_box agent_0 box_1 carrier_0 workstation_0 l4_5 capacity_1 capacity_2)
   deleted: (box_carried_by box_1 agent_0) (on carrier_0 box_1) (carrier_capacity carrier_0 capacity_1)
   added: (unloaded_box box_1 workstation_0) (carrier_capacity carrier_0 capacity_2)
   goals met: 0 of 1
13. (deliver_supply agent_1 workstation_0 tool supply_2 box_1 l4_5)
   deleted: (contains box_1 supply_2) (unloaded_box box_1 workstation_0)
   added: (loaded_to supply_2 workstation_0) (empty box_1) (at box_1 l4_5) (has workstation_0 tool)
   goals met: 1 of 1
